todo/app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "fdsdf"], ["created_at", "2016-03-10 22:23:28.919446"], ["updated_at", "2016-03-10 22:23:28.919446"]]